{"class_name": "Model", "config": {"name": "model_1", "output_layers": [["activation_58", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 640, 480, 3], "dtype": "float32"}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv1_1_3x3_s2", "padding": "same", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [2, 2], "dilation_rate": [1, 1]}, "name": "conv1_1_3x3_s2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1_1_3x3_s2", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv1_1_3x3_s2_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv1_1_3x3_s2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv1_1_3x3_s2_bn", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "name": "activation_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"name": "conv1_2_3x3", "padding": "same", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv1_2_3x3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1_2_3x3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv1_2_3x3_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv1_2_3x3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv1_2_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "name": "activation_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"name": "conv1_3_3x3", "padding": "same", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv1_3_3x3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1_3_3x3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv1_3_3x3_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv1_3_3x3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv1_3_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "name": "activation_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "max_pooling2d_1", "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "name": "max_pooling2d_1"}, {"class_name": "Activation", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "name": "activation_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"name": "conv2_1_1x1_reduce", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2_1_1x1_reduce"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_1x1_reduce", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_1_1x1_reduce_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv2_1_1x1_reduce_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_1_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "name": "activation_5"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"name": "zero_padding2d_1", "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}, "name": "zero_padding2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "config": {"name": "conv2_1_3x3", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2_1_3x3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_3x3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_1_3x3_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv2_1_3x3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_1_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "name": "activation_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"name": "conv2_1_1x1_increase", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2_1_1x1_increase"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"name": "conv2_1_1x1_proj", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2_1_1x1_proj"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_1x1_increase", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_1_1x1_increase_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv2_1_1x1_increase_bn"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_1x1_proj", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_1_1x1_proj_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv2_1_1x1_proj_bn"}, {"class_name": "Add", "inbound_nodes": [[["conv2_1_1x1_increase_bn", 0, 0, {}], ["conv2_1_1x1_proj_bn", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}, "name": "add_1"}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "name": "activation_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"name": "conv2_2_1x1_reduce", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2_2_1x1_reduce"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_2_1x1_reduce", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_2_1x1_reduce_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv2_2_1x1_reduce_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_2_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "name": "activation_8"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"name": "zero_padding2d_2", "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}, "name": "zero_padding2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "config": {"name": "conv2_2_3x3", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2_2_3x3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_2_3x3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_2_3x3_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv2_2_3x3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_2_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "name": "activation_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"name": "conv2_2_1x1_increase", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2_2_1x1_increase"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_2_1x1_increase", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_2_1x1_increase_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv2_2_1x1_increase_bn"}, {"class_name": "Add", "inbound_nodes": [[["conv2_2_1x1_increase_bn", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}, "name": "add_2"}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "name": "activation_10"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"name": "conv2_3_1x1_reduce", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2_3_1x1_reduce"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_3_1x1_reduce", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_3_1x1_reduce_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv2_3_1x1_reduce_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_3_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "name": "activation_11"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"name": "zero_padding2d_3", "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}, "name": "zero_padding2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "config": {"name": "conv2_3_3x3", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2_3_3x3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_3_3x3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_3_3x3_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv2_3_3x3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv2_3_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "name": "activation_12"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"name": "conv2_3_1x1_increase", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2_3_1x1_increase"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2_3_1x1_increase", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv2_3_1x1_increase_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv2_3_1x1_increase_bn"}, {"class_name": "Add", "inbound_nodes": [[["conv2_3_1x1_increase_bn", 0, 0, {}], ["activation_10", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}, "name": "add_3"}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "name": "activation_13"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"name": "conv3_1_1x1_reduce", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [2, 2], "dilation_rate": [1, 1]}, "name": "conv3_1_1x1_reduce"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_1x1_reduce", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_1_1x1_reduce_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_1_1x1_reduce_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_1_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "name": "activation_14"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"name": "zero_padding2d_4", "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}, "name": "zero_padding2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]], "config": {"name": "conv3_1_3x3", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv3_1_3x3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_3x3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_1_3x3_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_1_3x3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_1_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "name": "activation_15"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"name": "conv3_1_1x1_increase", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv3_1_1x1_increase"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"name": "conv3_1_1x1_proj", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [2, 2], "dilation_rate": [1, 1]}, "name": "conv3_1_1x1_proj"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_1x1_increase", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_1_1x1_increase_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_1_1x1_increase_bn"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_1x1_proj", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_1_1x1_proj_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_1_1x1_proj_bn"}, {"class_name": "Add", "inbound_nodes": [[["conv3_1_1x1_increase_bn", 0, 0, {}], ["conv3_1_1x1_proj_bn", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}, "name": "add_4"}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "name": "activation_16"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"name": "conv3_2_1x1_reduce", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv3_2_1x1_reduce"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_2_1x1_reduce", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_2_1x1_reduce_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_2_1x1_reduce_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_2_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "name": "activation_17"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"name": "zero_padding2d_5", "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}, "name": "zero_padding2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]], "config": {"name": "conv3_2_3x3", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv3_2_3x3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_2_3x3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_2_3x3_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_2_3x3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_2_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "name": "activation_18"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"name": "conv3_2_1x1_increase", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv3_2_1x1_increase"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_2_1x1_increase", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_2_1x1_increase_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_2_1x1_increase_bn"}, {"class_name": "Add", "inbound_nodes": [[["conv3_2_1x1_increase_bn", 0, 0, {}], ["activation_16", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}, "name": "add_5"}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "name": "activation_19"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"name": "conv3_3_1x1_reduce", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv3_3_1x1_reduce"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_3_1x1_reduce", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_3_1x1_reduce_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_3_1x1_reduce_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_3_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "name": "activation_20"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"name": "zero_padding2d_6", "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}, "name": "zero_padding2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]], "config": {"name": "conv3_3_3x3", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv3_3_3x3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_3_3x3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_3_3x3_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_3_3x3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_3_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "name": "activation_21"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"name": "conv3_3_1x1_increase", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv3_3_1x1_increase"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_3_1x1_increase", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_3_1x1_increase_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_3_1x1_increase_bn"}, {"class_name": "Add", "inbound_nodes": [[["conv3_3_1x1_increase_bn", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}, "name": "add_6"}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "name": "activation_22"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"name": "conv3_4_1x1_reduce", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv3_4_1x1_reduce"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_4_1x1_reduce", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_4_1x1_reduce_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_4_1x1_reduce_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_4_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "name": "activation_23"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"name": "zero_padding2d_7", "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}, "name": "zero_padding2d_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]], "config": {"name": "conv3_4_3x3", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv3_4_3x3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_4_3x3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_4_3x3_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_4_3x3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv3_4_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "name": "activation_24"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"name": "conv3_4_1x1_increase", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv3_4_1x1_increase"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv3_4_1x1_increase", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv3_4_1x1_increase_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv3_4_1x1_increase_bn"}, {"class_name": "Add", "inbound_nodes": [[["conv3_4_1x1_increase_bn", 0, 0, {}], ["activation_22", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}, "name": "add_7"}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "name": "activation_25"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"name": "conv4_1_1x1_reduce", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv4_1_1x1_reduce"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_1x1_reduce", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_1_1x1_reduce_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv4_1_1x1_reduce_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv4_1_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "name": "activation_26"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "config": {"name": "zero_padding2d_8", "padding": [[2, 2], [2, 2]], "data_format": "channels_last", "trainable": true}, "name": "zero_padding2d_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]], "config": {"name": "conv4_1_3x3", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [2, 2]}, "name": "conv4_1_3x3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_3x3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_1_3x3_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv4_1_3x3_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv4_1_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "name": "activation_27"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"name": "conv4_1_1x1_increase", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv4_1_1x1_increase"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"name": "conv4_1_1x1_proj", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv4_1_1x1_proj"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_1x1_increase", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_1_1x1_increase_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv4_1_1x1_increase_bn"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_1x1_proj", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_1_1x1_proj_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv4_1_1x1_proj_bn"}, {"class_name": "Add", "inbound_nodes": [[["conv4_1_1x1_increase_bn", 0, 0, {}], ["conv4_1_1x1_proj_bn", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}, "name": "add_8"}, {"class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_28", "trainable": true, "activation": "relu"}, "name": "activation_28"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"name": "conv4_2_1x1_reduce", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv4_2_1x1_reduce"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv4_2_1x1_reduce", 0, 0, {}]]], "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "conv4_2_1x1_reduce_bn", "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1e-05, "momentum": 0.95, "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "name": "conv4_2_1x1_reduce_bn"}, {"class_name": "Activation", "inbound_nodes": [[["conv4_2_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_29", "trainable": true, "activation": "relu"}, "name": "activation_29"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"name": "zero_padding2d_9", "padding": [[2, 2], [2, 2]], "data_format": "channels_last", "trainable": true}, "name": "zero_padding2d_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]], "config": {"name": "conv4_2_3x3", "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, 