{"keras_version": "2.0.5", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_58", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 640, 480, 3]}}, {"name": "conv1_1_3x3_s2", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [2, 2], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "name": "conv1_1_3x3_s2", "filters": 64, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv1_1_3x3_s2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1_1_3x3_s2", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1_1_3x3_s2_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["conv1_1_3x3_s2_bn", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"name": "conv1_2_3x3", "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "name": "conv1_2_3x3", "filters": 64, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv1_2_3x3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1_2_3x3", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1_2_3x3_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["conv1_2_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"name": "conv1_3_3x3", "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "name": "conv1_3_3x3", "filters": 128, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv1_3_3x3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1_3_3x3", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1_3_3x3_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["conv1_3_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "strides": [2, 2], "padding": "same", "data_format": "channels_last", "trainable": true, "pool_size": [3, 3]}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"name": "conv2_1_1x1_reduce", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv2_1_1x1_reduce", "filters": 64, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv2_1_1x1_reduce_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_1x1_reduce", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_1_1x1_reduce_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["conv2_1_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"name": "zero_padding2d_1", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv2_1_3x3", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv2_1_3x3", "filters": 64, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv2_1_3x3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_3x3", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_1_3x3_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["conv2_1_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"name": "conv2_1_1x1_increase", "class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv2_1_1x1_increase", "filters": 256, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv2_1_1x1_proj", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv2_1_1x1_proj", "filters": 256, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv2_1_1x1_increase_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_1x1_increase", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_1_1x1_increase_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "conv2_1_1x1_proj_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_1_1x1_proj", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_1_1x1_proj_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["conv2_1_1x1_increase_bn", 0, 0, {}], ["conv2_1_1x1_proj_bn", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"name": "conv2_2_1x1_reduce", "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv2_2_1x1_reduce", "filters": 64, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv2_2_1x1_reduce_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_2_1x1_reduce", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_2_1x1_reduce_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["conv2_2_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"name": "zero_padding2d_2", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv2_2_3x3", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv2_2_3x3", "filters": 64, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv2_2_3x3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_2_3x3", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_2_3x3_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["conv2_2_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"name": "conv2_2_1x1_increase", "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv2_2_1x1_increase", "filters": 256, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv2_2_1x1_increase_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_2_1x1_increase", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_2_1x1_increase_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["conv2_2_1x1_increase_bn", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"name": "conv2_3_1x1_reduce", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv2_3_1x1_reduce", "filters": 64, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv2_3_1x1_reduce_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_3_1x1_reduce", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_3_1x1_reduce_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_11", "class_name": "Activation", "inbound_nodes": [[["conv2_3_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_11", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"name": "zero_padding2d_3", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv2_3_3x3", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv2_3_3x3", "filters": 64, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv2_3_3x3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_3_3x3", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_3_3x3_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_12", "class_name": "Activation", "inbound_nodes": [[["conv2_3_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_12", "activation": "relu", "trainable": true}}, {"name": "conv2_3_1x1_increase", "class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv2_3_1x1_increase", "filters": 256, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv2_3_1x1_increase_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_3_1x1_increase", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2_3_1x1_increase_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["conv2_3_1x1_increase_bn", 0, 0, {}], ["activation_10", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"name": "activation_13", "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_13", "activation": "relu", "trainable": true}}, {"name": "conv3_1_1x1_reduce", "class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [2, 2], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_1_1x1_reduce", "filters": 128, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_1_1x1_reduce_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_1x1_reduce", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_1_1x1_reduce_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_14", "class_name": "Activation", "inbound_nodes": [[["conv3_1_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_14", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_4", "class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"name": "zero_padding2d_4", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv3_1_3x3", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_1_3x3", "filters": 128, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_1_3x3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_3x3", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_1_3x3_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_15", "class_name": "Activation", "inbound_nodes": [[["conv3_1_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_15", "activation": "relu", "trainable": true}}, {"name": "conv3_1_1x1_increase", "class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_1_1x1_increase", "filters": 512, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_1_1x1_proj", "class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [2, 2], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_1_1x1_proj", "filters": 512, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_1_1x1_increase_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_1x1_increase", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_1_1x1_increase_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "conv3_1_1x1_proj_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_1_1x1_proj", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_1_1x1_proj_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "add_4", "class_name": "Add", "inbound_nodes": [[["conv3_1_1x1_increase_bn", 0, 0, {}], ["conv3_1_1x1_proj_bn", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}}, {"name": "activation_16", "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_16", "activation": "relu", "trainable": true}}, {"name": "conv3_2_1x1_reduce", "class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_2_1x1_reduce", "filters": 128, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_2_1x1_reduce_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_2_1x1_reduce", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_2_1x1_reduce_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_17", "class_name": "Activation", "inbound_nodes": [[["conv3_2_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_17", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_5", "class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"name": "zero_padding2d_5", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv3_2_3x3", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_2_3x3", "filters": 128, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_2_3x3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_2_3x3", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_2_3x3_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_18", "class_name": "Activation", "inbound_nodes": [[["conv3_2_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_18", "activation": "relu", "trainable": true}}, {"name": "conv3_2_1x1_increase", "class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_2_1x1_increase", "filters": 512, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_2_1x1_increase_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_2_1x1_increase", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_2_1x1_increase_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "add_5", "class_name": "Add", "inbound_nodes": [[["conv3_2_1x1_increase_bn", 0, 0, {}], ["activation_16", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}}, {"name": "activation_19", "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_19", "activation": "relu", "trainable": true}}, {"name": "conv3_3_1x1_reduce", "class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_3_1x1_reduce", "filters": 128, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_3_1x1_reduce_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_3_1x1_reduce", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_3_1x1_reduce_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_20", "class_name": "Activation", "inbound_nodes": [[["conv3_3_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_20", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_6", "class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"name": "zero_padding2d_6", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv3_3_3x3", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_3_3x3", "filters": 128, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_3_3x3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_3_3x3", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_3_3x3_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_21", "class_name": "Activation", "inbound_nodes": [[["conv3_3_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_21", "activation": "relu", "trainable": true}}, {"name": "conv3_3_1x1_increase", "class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_3_1x1_increase", "filters": 512, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_3_1x1_increase_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_3_1x1_increase", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_3_1x1_increase_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "add_6", "class_name": "Add", "inbound_nodes": [[["conv3_3_1x1_increase_bn", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}}, {"name": "activation_22", "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_22", "activation": "relu", "trainable": true}}, {"name": "conv3_4_1x1_reduce", "class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_4_1x1_reduce", "filters": 128, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_4_1x1_reduce_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_4_1x1_reduce", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_4_1x1_reduce_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_23", "class_name": "Activation", "inbound_nodes": [[["conv3_4_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_23", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_7", "class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"name": "zero_padding2d_7", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv3_4_3x3", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_4_3x3", "filters": 128, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_4_3x3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_4_3x3", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_4_3x3_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_24", "class_name": "Activation", "inbound_nodes": [[["conv3_4_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_24", "activation": "relu", "trainable": true}}, {"name": "conv3_4_1x1_increase", "class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv3_4_1x1_increase", "filters": 512, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv3_4_1x1_increase_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_4_1x1_increase", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3_4_1x1_increase_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "add_7", "class_name": "Add", "inbound_nodes": [[["conv3_4_1x1_increase_bn", 0, 0, {}], ["activation_22", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}}, {"name": "activation_25", "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_25", "activation": "relu", "trainable": true}}, {"name": "conv4_1_1x1_reduce", "class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv4_1_1x1_reduce", "filters": 256, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv4_1_1x1_reduce_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_1x1_reduce", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv4_1_1x1_reduce_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_26", "class_name": "Activation", "inbound_nodes": [[["conv4_1_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_26", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_8", "class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "config": {"name": "zero_padding2d_8", "data_format": "channels_last", "trainable": true, "padding": [[2, 2], [2, 2]]}}, {"name": "conv4_1_3x3", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv4_1_3x3", "filters": 256, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [2, 2], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv4_1_3x3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_3x3", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv4_1_3x3_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_27", "class_name": "Activation", "inbound_nodes": [[["conv4_1_3x3_bn", 0, 0, {}]]], "config": {"name": "activation_27", "activation": "relu", "trainable": true}}, {"name": "conv4_1_1x1_increase", "class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv4_1_1x1_increase", "filters": 1024, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv4_1_1x1_proj", "class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv4_1_1x1_proj", "filters": 1024, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv4_1_1x1_increase_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_1x1_increase", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv4_1_1x1_increase_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "conv4_1_1x1_proj_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_1_1x1_proj", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv4_1_1x1_proj_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "add_8", "class_name": "Add", "inbound_nodes": [[["conv4_1_1x1_increase_bn", 0, 0, {}], ["conv4_1_1x1_proj_bn", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}}, {"name": "activation_28", "class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_28", "activation": "relu", "trainable": true}}, {"name": "conv4_2_1x1_reduce", "class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "bias_constraint": null, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "name": "conv4_2_1x1_reduce", "filters": 256, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null}}, {"name": "conv4_2_1x1_reduce_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_2_1x1_reduce", 0, 0, {}]]], "config": {"momentum": 0.95, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv4_2_1x1_reduce_bn", "epsilon": 1e-05, "beta_constraint": null, "trainable": true, "center": true}}, {"name": "activation_29", "class_name": "Activation", "inbound_nodes": [[["conv4_2_1x1_reduce_bn", 0, 0, {}]]], "config": {"name": "activation_29", "activation": "relu", "trainable": true}}, {"name": "zero_padding2d_9", "class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"name": "zero_padding2d_9", "data_format": "channels_last", "trainable": true, "padding": [[2, 2], [2, 2]]}}, {"name": "conv4_2_3x3", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, 